ISA/main.html
<?xml version="1.0" encoding="utf-8"?>
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-12-27 Fri 16:05 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Síťové aplikace a správa sítí</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="John Doe" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">Síťové aplikace a správa sítí</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org4bdef42">1. Architektura sítí</a>
<ul>
<li><a href="#org4b194f8">1.1. Model OSI</a></li>
<li><a href="#orgb0e91fa">1.2. Model IEEE</a></li>
<li><a href="#orgd8dce11">1.3. Model TCP/IP</a></li>
</ul>
</li>
<li><a href="#orgfde7af2">2. Adresování</a>
<ul>
<li><a href="#org855cf64">2.1. Adresa</a></li>
<li><a href="#org633a8a3">2.2. Adresování a směrování v modelu TCP/IP</a></li>
<li><a href="#orgdd7c8f1">2.3. Adresování a směrování na fyzickém rozhraní (L2)</a>
<ul>
<li><a href="#orgf455dd9">2.3.1. Speciální adresy L2 vrstvy</a></li>
</ul>
</li>
<li><a href="#org93c4a33">2.4. Adresování a směrování na síťové (IP) vrstvě</a>
<ul>
<li><a href="#orgc2ac3cd">2.4.1. Přidělování adres</a></li>
</ul>
</li>
<li><a href="#orgfb67005">2.5. Adresování a směrování na transportní vrstvě</a></li>
<li><a href="#org1600e6e">2.6. Adresování na aplikační vrstvě</a></li>
</ul>
</li>
<li><a href="#orgf0178bf">3. Základní nástroje pro konfiguraci</a>
<ul>
<li><a href="#orgbcd29f5">3.1. Výpis aktuálního síťového nastavení</a></li>
<li><a href="#org186abaf">3.2. Testování základní konektivity</a></li>
<li><a href="#org45a9cf3">3.3. Kontrola směrování</a></li>
<li><a href="#orgec3a27f">3.4. Testování dosažitelnosti vzdáleného počítače</a></li>
<li><a href="#org0719a3a">3.5. Testování dostupnosti služeb</a></li>
<li><a href="#orgac107f2">3.6. Výpis otevřených spojení</a></li>
<li><a href="#org62fce95">3.7. Sledování komunikace na síťovém rozhraní</a></li>
</ul>
</li>
<li><a href="#org7bc427f">4. Programování sítí TCP/IP</a>
<ul>
<li><a href="#org0b0c5dd">4.1. Komunikace klient &#x2013; server</a></li>
<li><a href="#org83fab10">4.2. Prostředky pro meziprocesovou komunikaci</a></li>
<li><a href="#org30d9884">4.3. Sockety</a>
<ul>
<li><a href="#org754c74c">4.3.1. Funkce v BSD socketech pro vytvoření konkurentního serveru TCP</a></li>
<li><a href="#orgfeb0671">4.3.2. UDP schránky</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org60ddafe">5. Komunikace typu multicast</a>
<ul>
<li><a href="#org88dc077">5.1. Mapování multicastové adresy IPv4 na MAC adresu</a></li>
<li><a href="#org198d141">5.2. Mapování multicastové adresy IPv6 na MAC adresu</a></li>
<li><a href="#org0c60a3d">5.3. Vlastnosti multicastové komunikace</a></li>
<li><a href="#orgb048088">5.4. Multicast a sockety</a></li>
</ul>
</li>
<li><a href="#org8c38f89">6. Analýza paketů na linkové vrstvě</a>
<ul>
<li><a href="#org4bb4f40">6.1. Nástroje pro zpracování paketů na linkové vrstvě</a></li>
<li><a href="#org43206c6">6.2. BSD Packet Filter</a></li>
<li><a href="#org6f33d08">6.3. Knihovna <code>libpcap</code></a></li>
</ul>
</li>
<li><a href="#orga11e807">7. Zabezpečení počítačových sítí</a></li>
<li><a href="#org2f552c7">8. Symetrické šifrování s tajným klíčem</a>
<ul>
<li><a href="#orga528003">8.1. Rovnice pro symetrické šifrování</a></li>
<li><a href="#org45d44f5">8.2. Bezpečnost symetrického šifrování</a></li>
<li><a href="#org217549f">8.3. Výhody a nevýhody</a></li>
<li><a href="#org95c0498">8.4. Příklady symetrických šifrovacích algoritmů</a>
<ul>
<li><a href="#org2c65bd6">8.4.1. Blokové</a></li>
<li><a href="#orga0bf812">8.4.2. Proudové</a></li>
</ul>
</li>
<li><a href="#org265a58a">8.5. Nástroje pro symetrické šifrování</a></li>
</ul>
</li>
<li><a href="#orgad06679">9. Asymetrické šifrování s veřejným klíčem</a>
<ul>
<li><a href="#orgb9f167a">9.1. Princip</a></li>
<li><a href="#orgf8ec83d">9.2. Rovnice pro asymetrické šifrování</a>
<ul>
<li><a href="#orgd1644b4">9.2.1. Šifrování</a></li>
<li><a href="#orgb88b64a">9.2.2. Dešifrování</a></li>
</ul>
</li>
<li><a href="#org9e17e2e">9.3. Výhody a nevýhody</a></li>
<li><a href="#org782f7d2">9.4. Příklady asymetrických šifrovacích algoritmů</a></li>
<li><a href="#org2a5fe6c">9.5. Nástroje pro asymetrické šifrování</a></li>
</ul>
</li>
<li><a href="#org2946b99">10. Zajíštění integrity dat pomocí kryptografického hashe</a>
<ul>
<li><a href="#org9d889ce">10.1. Nástroje pro hashování</a></li>
</ul>
</li>
<li><a href="#orge904c5d">11. Elektronický podpis</a>
<ul>
<li><a href="#org0bb0773">11.1. Princip a rovnice</a>
<ul>
<li><a href="#org96ca51e">11.1.1. Podepsání</a></li>
<li><a href="#org153b863">11.1.2. Ověření podpisu</a></li>
</ul>
</li>
<li><a href="#org5f17fe1">11.2. Příklady algoritmů</a></li>
<li><a href="#org3300071">11.3. Používání elektronického podpisu</a></li>
</ul>
</li>
<li><a href="#org9118bc4">12. Digitální certifikát X.509</a>
<ul>
<li><a href="#org293b713">12.1. Obsah certifikátu X.509</a></li>
<li><a href="#org2464270">12.2. Použití digitálních certifikátů</a></li>
</ul>
</li>
<li><a href="#org3dc3b0e">13. Diffie-Hellman</a>
<ul>
<li><a href="#orgebcb0e8">13.1. Postup</a></li>
</ul>
</li>
<li><a href="#org010b719">14. Zabezpečení komunikace na modelu TCP/IP</a></li>
<li><a href="#orgc094fba">15. Transport Layer Security (TLS)</a>
<ul>
<li><a href="#org1988b78">15.1. TLS Handshake</a></li>
<li><a href="#org8d28dde">15.2. Vlastnosti</a></li>
<li><a href="#orgf8d244c">15.3. Omezení TLS</a></li>
</ul>
</li>
<li><a href="#orgaa4fb83">16. IPSec</a>
<ul>
<li><a href="#orga8d9555">16.1. Protokol AH (Authentication Header)</a></li>
<li><a href="#org13ff68a">16.2. Protokol ESP (Encapsulation Security Protocol)</a></li>
</ul>
</li>
<li><a href="#org94d7e60">17. Zabezpečení emailových zpráv pomocí PGP (Pretty Good Privacy)</a></li>
<li><a href="#orgfa701b8">18. Autentizace zpráv směrovacího protokolu OSPF</a></li>
<li><a href="#org9ac5b7c">19. Domain Name System</a>
<ul>
<li><a href="#org1daa7ed">19.1. Správa domén</a></li>
<li><a href="#org1d62763">19.2. Správa IP adres</a></li>
<li><a href="#org4087fa0">19.3. Whois</a></li>
<li><a href="#org2db2a22">19.4. DNS server</a></li>
<li><a href="#orgdfb9ddb">19.5. Protokol DNS</a></li>
<li><a href="#org2ea3741">19.6. DNS rezoluce</a>
<ul>
<li><a href="#org3b325c0">19.6.1. Rekurzivní dotaz</a></li>
<li><a href="#org750a2cf">19.6.2. Iterativní dotaz</a></li>
</ul>
</li>
<li><a href="#org9aae033">19.7. Přenos zón</a></li>
<li><a href="#org37eed09">19.8. Typy záznamů v DNS</a>
<ul>
<li><a href="#org2605051">19.8.1. Start of Authority (SOA)</a></li>
<li><a href="#org504f56a">19.8.2. Name Server (NS)</a></li>
<li><a href="#org0e651ab">19.8.3. A</a></li>
<li><a href="#orgeae4d79">19.8.4. AAAA</a></li>
<li><a href="#orgc627d13">19.8.5. Mail Exchange (MX)</a></li>
<li><a href="#orge510e8c">19.8.6. Canonical Name (CNAME)</a></li>
<li><a href="#orgd64fffd">19.8.7. Domain Name Pointer (PTR)</a></li>
<li><a href="#orgf4edd10">19.8.8. Naming Autority Pointer (NAPTR)</a></li>
<li><a href="#orgd280324">19.8.9. Service Record (SRV)</a></li>
<li><a href="#orgf239b42">19.8.10. Text (TXT)</a></li>
</ul>
</li>
<li><a href="#orgaa9e5c0">19.9. Zabezpečení systému DNS</a>
<ul>
<li><a href="#org8823ddb">19.9.1. Bezpečnostní rizika</a></li>
<li><a href="#org4a74eb9">19.9.2. DNSSEC</a></li>
</ul>
</li>
<li><a href="#orgef06a1c">19.10. Monitorování provozu DNS</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org4bdef42" class="outline-2">
<h2 id="org4bdef42"><span class="section-number-2">1</span> Architektura sítí</h2>
<div class="outline-text-2" id="text-1">
<p>
Vrstvový model definuje síťové vrstvy.
Každá vrstva určuje obecné funkce poskytované vyšším vrstvám.
Funkce dané vrstvy jsou implementovány příslušnými protokoly dané vrstvy.
Pro služby vyšší vrstvy je činnost nižších vrstev transparentní.
</p>

<p>
Při komunikaci na vrstvách komunikující koncové body leží vždy ve stejné vrstvě
a pro komunikaci se využívá služeb nižších vrstev.
</p>

<p>
Procesy aplikační vrstvy komunikují pomocí socketů (schránek). Ty jsou
identifikovány IP adresou a číslem portu.
</p>
</div>


<div id="outline-container-org4b194f8" class="outline-3">
<h3 id="org4b194f8"><span class="section-number-3">1.1</span> Model OSI</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Model OSI definuje 7 vrstev:
</p>

<ol class="org-ol">
<li>Fyzická vrstva</li>
<li>Linková vrstva</li>
<li>Síťová vrstva</li>
<li>Transportní vrstva</li>
<li>Vrstva sezení</li>
<li>Prezentační vrstva</li>
<li>Aplikační vrstva</li>
</ol>
</div>
</div>

<div id="outline-container-orgb0e91fa" class="outline-3">
<h3 id="orgb0e91fa"><span class="section-number-3">1.2</span> Model IEEE</h3>
<div class="outline-text-3" id="text-1-2">
<p>
Model IEEE definuje 2 vrstvy:
</p>

<ol class="org-ol">
<li>MAC vrstva</li>
<li>LLC vrstva</li>
</ol>
</div>
</div>

<div id="outline-container-orgd8dce11" class="outline-3">
<h3 id="orgd8dce11"><span class="section-number-3">1.3</span> Model TCP/IP</h3>
<div class="outline-text-3" id="text-1-3">
<p>
Definuje 4 vrstvy:
</p>

<ol class="org-ol">
<li>Vrstva síťového rozhraní (fyzická a linková vrstva dle OSI)</li>
<li>Internetová vrstva (síťová vrstva dle OSI)</li>
<li>Transportní vrstva</li>
<li>Aplikační vrstva</li>
</ol>
</div>
</div>
</div>

<div id="outline-container-orgfde7af2" class="outline-2">
<h2 id="orgfde7af2"><span class="section-number-2">2</span> Adresování</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org855cf64" class="outline-3">
<h3 id="org855cf64"><span class="section-number-3">2.1</span> Adresa</h3>
<div class="outline-text-3" id="text-2-1">
<p>
Adresa je způsob identifikace adresáta pomocí jednoznačné informace
</p>
</div>
</div>

<div id="outline-container-org633a8a3" class="outline-3">
<h3 id="org633a8a3"><span class="section-number-3">2.2</span> Adresování a směrování v modelu TCP/IP</h3>
<div class="outline-text-3" id="text-2-2">
<p>
Každá vrstva modelu TCP/IP definuje svoje adresování a zajišťuje určitou formu
směrování. Některé služby používají mapování adres mezi vrstvami.
</p>
</div>
</div>

<div id="outline-container-orgdd7c8f1" class="outline-3">
<h3 id="orgdd7c8f1"><span class="section-number-3">2.3</span> Adresování a směrování na fyzickém rozhraní (L2)</h3>
<div class="outline-text-3" id="text-2-3">
<p>
Adresuje se konkrétní síťové rozhraní počítače. To je identifikováno 48bitovou
fyzickou adresou. Ta určuje adresování v lokální síti. Prvních 24 bitů je OUI
(Organizational Unique Identifier), zbylých 24 bitů je číslo síťového rozhraní
přiděleného výrobcem karty. L2 rámec obsahuje:
</p>
<ul class="org-ul">
<li>7+1B preambule (synchronizace + typ)</li>
<li>48b source address</li>
<li>48b destination address</li>
<li>16b ethertype</li>
<li>&#x2026; data &#x2026; (max 1500 B)</li>
<li>32b checksum</li>
</ul>
</div>

<div id="outline-container-orgf455dd9" class="outline-4">
<h4 id="orgf455dd9"><span class="section-number-4">2.3.1</span> Speciální adresy L2 vrstvy</h4>
<div class="outline-text-4" id="text-2-3-1">
<ul class="org-ul">
<li>Broadcast: <code>FF FF FF FF FF FF</code></li>
<li>IPv4 multicast <code>01 00 5e xx xx xx</code></li>
<li>IPv6 multicast <code>33 33 xx xx xx xx</code></li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org93c4a33" class="outline-3">
<h3 id="org93c4a33"><span class="section-number-3">2.4</span> Adresování a směrování na síťové (IP) vrstvě</h3>
<div class="outline-text-3" id="text-2-4">
<p>
Používá se 32bitová IPv4 adresa nebo 128bitová IPv6 adresa. IP adresa
jednoznačně identifikuje síťové rozhraní počítače v síti. Je určena pro
adresování i mimo lokální síť.
</p>

<p>
IPv4 se může adresovat s využitím tříd (A, B, C, D, E). Používá se <code>netid +
hostid</code>. Délku části <code>netid</code> určuje pevná nebo proměnná maska.
</p>

<p>
Při použití variabilní délky masky se prostor IPv4 adres dá efektivněji využít,
vytváří se podsítě (subnetting). Používá se beztřídní směrování.
</p>
</div>
