ISA/main.org
*** Přidělování adres
Přidělení IP adres může být provedeno buď manuálně v operačním systému nebo
dynamicky pomocí DHCP.

Pro IPv4 se používá protokol DHCPv4. Nové zařízení vyhledává DHCP server na
lokální síti pomocí broadcastu.

Pro IPv6 se používá více způsobů přidělování adres. Typ přidělení oznamuje
směrovač zprávou ICMPv6 RA. Typ konfigurace může být:

1. Bezstavová konfigurace pomocí SLAAC (Stateless Autoconfiguration)
2. Bezstavová konfigurace pomocí SLAAC a DHCPv6
3. Stavová konfigurace pomocí DHCPv6

** Adresování a směrování na transportní vrstvě
Adresuje je konkrétní služba pomocí 16b čísla portu (uvedena v ~/etc/services~).
Číslo portu jednoznačně identifiuje službu na daném počítači. Rozlišujeme
spojované (TCP) a nespojované (UDP) služby.

** Adresování na aplikační vrstvě
Je závislé na konkrétní aplikaci. Příklady:
+ Elektronická pošta: xlogin00@stud.fit.vutbr.cz
+ DNS: eva.fit.vutbr.cz
+ WWW: http://www.fit.vutbr.cz/index.html
+ IP telefonie: sip:login@cesnet.cz
+ SNMP: 1.3.6.1.2.1.2.1 (ifNumber)
+ LDAP: cn=login, ou=Students, dc=vutbr, dc=cz
+ FTP: /public/index.txt

* Základní nástroje pro konfiguraci
** Výpis aktuálního síťového nastavení
+ ~ifconfig~, ~ip link~, ~ip address~ (Linux)
+ ~ipconfig~ (Windows)

** Testování základní konektivity
+ ~ping~, ~pathping~

** Kontrola směrování
+ ~netstat -r~, ~ip route~ : Vypíše směrovací tabulku
+ ~arp -a~, ~ip neigh~ : Vypíše tabulku ARP, respektive Neighbour Cache

** Testování dosažitelnosti vzdáleného počítače
+ ~tracert~, ~traceroute~, ~tcptraceroute~

** Testování dostupnosti služeb
+ ~telnet <addr> <port>~

** Výpis otevřených spojení
+ ~sockstat~ (FreeBSD)
+ ~netstat -natu~ (Linux)
+ ~netstat -a~ (Windows)

** Sledování komunikace na síťovém rozhraní
+ ~tcpdump~
+ ~tshark~
+ Wireshark (GUI1)
* Programování sítí TCP/IP
** Komunikace klient -- server
Jedná se o standardní schema komunikace mezi dvěma procesy. Komunikace je
popsána protokolem. Klient posílá požadavky na zpracování serveru, ten je
zpracuje a pošle odpověď. Komunikace je obvykle zahájena klientem.

Protokol je soubor syntaktických a sématnických pravidel určujících výměnu dat.
Popisuje vytvoření spojení, adresování, přenos dat, řízení toku, zabezpečení.
Formálně je protokol specifikován stavovými automaty, gramatikami, formálními
jazyky, Petriho sítěmi, diagramy posloupnosti zpráv nebo algebraickými
prostředky.

** Prostředky pro meziprocesovou komunikaci
Unixové roury, Unix to Unix copy, Remote Procedure Call, BSD sockets, Winsock.

** Sockety
Aplikační programové rozhraní pro komunikující procesy. Definují konečný
komunikační bod. Implementovány jako abstraktní datové struktury obsahující
údaje pro komunikaci. Jsou jednoznačně implementovány v síti pomocí IP adresy a
čísla portu. Jsou implementovány ve většině programovacích jazyků.

Vytvářejí rozhraní na vrstvě L4 (transportní). Rozlišujeme několik typů
schránek. Základní typy jsou:

1. ~SOCK_STREAM~ (TCP komunikace)
2. ~SOCK_DGRAM~ (UDP datagramy)
3. ~SOCK_RAW~ (Holá schránka bez žádného protokolu. Nutno vyplnit všechny
   hlavičky ručně)

*** Funkce v BSD socketech pro vytvoření konkurentního serveru TCP
1. ~socket()~ -- Vytvoří schránku
2. ~bind()~ -- Připojení schránky na lokální port
3. ~listen()~ -- Vytrvoření fronty příchozích požadavků
4. ~accept()~ -- Přijímání požadavků
5. ~fork()~ -- Vytvoření synovského procesu
6. ~read(), write()~ -- Výměna dat v rámci synovského procesu
7. ~close()~ -- Zavření schránky synovského procesu
8. ~exit()~ -- Ukončení synovského procesu
9. ~close()~ -- Uzavření schránky rodičovského procesu

*** UDP schránky
Když neběží UDP server, klient pošle zprávu pomocí ~sendto()~, čeká na odpověď
pomocí ~recvfrom()~. Dojde ale k uváznutí, protože UDP neposkytuje možnosti, jak
oznámit nedostupný port. Možná řešení jsou použití timeoutu nebo spojovaných UDP
schránek.

Spojované UDP schránky používají funkci ~connect()~, nedochází ale k vytvoření
TCP spojení, pouze se zpracovávají chyby. Funkce ~connect()~ zjistí aktuální
stav serveru, v budoucnu však může dojít k ukončení činnosti UDP serveru a
klient to nezjístí. Funkce ~connect()~ se tak může volat opakovaně.
* Komunikace typu multicast
Jeden paket doručen skupině  uzlů v multicastové skupině. Používá se jedna
cílová adresa typu multicast. Pro IPv4 tato adresa náleží do třídy D, tedy
rozsah ~22.0.0.0~ -- ~239.255.255.255~. Pro IPv6 se jedná o adresy s prefixem
~0xFF00::/8~.

Multicastová komunikace umožňuje dynamické připojování uzlů do multicastové
skupiny, speciální směrování multicastových adres a řízení dosahu multicastového
vysílání.

Pro výpis aktivních multicastových skupin existují příkazy:
+ ~ifmcstat~ (FreeBSD)
+ ~netstat -g~, ~netstat -gn~ (Linux)
+ ~netsh interface ip show joins~ (Windows)

Směrování IP multicastu je implementováno pomocí protokolů DVMRP, PIM, MOSPF.
Připojování uzlů do multicastových skupin probíhá pomocí protokolů IGMPv2,
IGMPv3, MLD.

** Mapování multicastové adresy IPv4 na MAC adresu
Prefix multicastové MAC adresy je ~0x01 01 5e~. Z multicastové adresy se použije
jen posledních 23b  do multicastové MAC adresy. Může docházet k překrývání
adres.

** Mapování multicastové adresy IPv6 na MAC adresu
Nejnižších 32b IPv6 adresy je zkopírováno do MAC adresy, prefix multicastové
adresy MAC je ~0x33 33~.

