ISA/main.html

<div id="outline-container-orgc2ac3cd" class="outline-4">
<h4 id="orgc2ac3cd"><span class="section-number-4">2.4.1</span> Přidělování adres</h4>
<div class="outline-text-4" id="text-2-4-1">
<p>
Přidělení IP adres může být provedeno buď manuálně v operačním systému nebo
dynamicky pomocí DHCP.
</p>

<p>
Pro IPv4 se používá protokol DHCPv4. Nové zařízení vyhledává DHCP server na
lokální síti pomocí broadcastu.
</p>

<p>
Pro IPv6 se používá více způsobů přidělování adres. Typ přidělení oznamuje
směrovač zprávou ICMPv6 RA. Typ konfigurace může být:
</p>

<ol class="org-ol">
<li>Bezstavová konfigurace pomocí SLAAC (Stateless Autoconfiguration)</li>
<li>Bezstavová konfigurace pomocí SLAAC a DHCPv6</li>
<li>Stavová konfigurace pomocí DHCPv6</li>
</ol>
</div>
</div>
</div>

<div id="outline-container-orgfb67005" class="outline-3">
<h3 id="orgfb67005"><span class="section-number-3">2.5</span> Adresování a směrování na transportní vrstvě</h3>
<div class="outline-text-3" id="text-2-5">
<p>
Adresuje je konkrétní služba pomocí 16b čísla portu (uvedena v <code>/etc/services</code>).
Číslo portu jednoznačně identifiuje službu na daném počítači. Rozlišujeme
spojované (TCP) a nespojované (UDP) služby.
</p>
</div>
</div>

<div id="outline-container-org1600e6e" class="outline-3">
<h3 id="org1600e6e"><span class="section-number-3">2.6</span> Adresování na aplikační vrstvě</h3>
<div class="outline-text-3" id="text-2-6">
<p>
Je závislé na konkrétní aplikaci. Příklady:
</p>
<ul class="org-ul">
<li>Elektronická pošta: xlogin00@stud.fit.vutbr.cz</li>
<li>DNS: eva.fit.vutbr.cz</li>
<li>WWW: <a href="http://www.fit.vutbr.cz/index.html">http://www.fit.vutbr.cz/index.html</a></li>
<li>IP telefonie: sip:login@cesnet.cz</li>
<li>SNMP: 1.3.6.1.2.1.2.1 (ifNumber)</li>
<li>LDAP: cn=login, ou=Students, dc=vutbr, dc=cz</li>
<li>FTP: /public/index.txt</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgf0178bf" class="outline-2">
<h2 id="orgf0178bf"><span class="section-number-2">3</span> Základní nástroje pro konfiguraci</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-orgbcd29f5" class="outline-3">
<h3 id="orgbcd29f5"><span class="section-number-3">3.1</span> Výpis aktuálního síťového nastavení</h3>
<div class="outline-text-3" id="text-3-1">
<ul class="org-ul">
<li><code>ifconfig</code>, <code>ip link</code>, <code>ip address</code> (Linux)</li>
<li><code>ipconfig</code> (Windows)</li>
</ul>
</div>
</div>

<div id="outline-container-org186abaf" class="outline-3">
<h3 id="org186abaf"><span class="section-number-3">3.2</span> Testování základní konektivity</h3>
<div class="outline-text-3" id="text-3-2">
<ul class="org-ul">
<li><code>ping</code>, <code>pathping</code></li>
</ul>
</div>
</div>

<div id="outline-container-org45a9cf3" class="outline-3">
<h3 id="org45a9cf3"><span class="section-number-3">3.3</span> Kontrola směrování</h3>
<div class="outline-text-3" id="text-3-3">
<ul class="org-ul">
<li><code>netstat -r</code>, <code>ip route</code> : Vypíše směrovací tabulku</li>
<li><code>arp -a</code>, <code>ip neigh</code> : Vypíše tabulku ARP, respektive Neighbour Cache</li>
</ul>
</div>
</div>

<div id="outline-container-orgec3a27f" class="outline-3">
<h3 id="orgec3a27f"><span class="section-number-3">3.4</span> Testování dosažitelnosti vzdáleného počítače</h3>
<div class="outline-text-3" id="text-3-4">
<ul class="org-ul">
<li><code>tracert</code>, <code>traceroute</code>, <code>tcptraceroute</code></li>
</ul>
</div>
</div>

<div id="outline-container-org0719a3a" class="outline-3">
<h3 id="org0719a3a"><span class="section-number-3">3.5</span> Testování dostupnosti služeb</h3>
<div class="outline-text-3" id="text-3-5">
<ul class="org-ul">
<li><code>telnet &lt;addr&gt; &lt;port&gt;</code></li>
</ul>
</div>
</div>

<div id="outline-container-orgac107f2" class="outline-3">
<h3 id="orgac107f2"><span class="section-number-3">3.6</span> Výpis otevřených spojení</h3>
<div class="outline-text-3" id="text-3-6">
<ul class="org-ul">
<li><code>sockstat</code> (FreeBSD)</li>
<li><code>netstat -natu</code> (Linux)</li>
<li><code>netstat -a</code> (Windows)</li>
</ul>
</div>
</div>

<div id="outline-container-org62fce95" class="outline-3">
<h3 id="org62fce95"><span class="section-number-3">3.7</span> Sledování komunikace na síťovém rozhraní</h3>
<div class="outline-text-3" id="text-3-7">
<ul class="org-ul">
<li><code>tcpdump</code></li>
<li><code>tshark</code></li>
<li>Wireshark (GUI1)</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org7bc427f" class="outline-2">
<h2 id="org7bc427f"><span class="section-number-2">4</span> Programování sítí TCP/IP</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-org0b0c5dd" class="outline-3">
<h3 id="org0b0c5dd"><span class="section-number-3">4.1</span> Komunikace klient &#x2013; server</h3>
<div class="outline-text-3" id="text-4-1">
<p>
Jedná se o standardní schema komunikace mezi dvěma procesy. Komunikace je
popsána protokolem. Klient posílá požadavky na zpracování serveru, ten je
zpracuje a pošle odpověď. Komunikace je obvykle zahájena klientem.
</p>

<p>
Protokol je soubor syntaktických a sématnických pravidel určujících výměnu dat.
Popisuje vytvoření spojení, adresování, přenos dat, řízení toku, zabezpečení.
Formálně je protokol specifikován stavovými automaty, gramatikami, formálními
jazyky, Petriho sítěmi, diagramy posloupnosti zpráv nebo algebraickými
prostředky.
</p>
</div>
</div>

<div id="outline-container-org83fab10" class="outline-3">
<h3 id="org83fab10"><span class="section-number-3">4.2</span> Prostředky pro meziprocesovou komunikaci</h3>
<div class="outline-text-3" id="text-4-2">
<p>
Unixové roury, Unix to Unix copy, Remote Procedure Call, BSD sockets, Winsock.
</p>
</div>
</div>

<div id="outline-container-org30d9884" class="outline-3">
<h3 id="org30d9884"><span class="section-number-3">4.3</span> Sockety</h3>
<div class="outline-text-3" id="text-4-3">
<p>
Aplikační programové rozhraní pro komunikující procesy. Definují konečný
komunikační bod. Implementovány jako abstraktní datové struktury obsahující
údaje pro komunikaci. Jsou jednoznačně implementovány v síti pomocí IP adresy a
čísla portu. Jsou implementovány ve většině programovacích jazyků.
</p>

<p>
Vytvářejí rozhraní na vrstvě L4 (transportní). Rozlišujeme několik typů
schránek. Základní typy jsou:
</p>

<ol class="org-ol">
<li><code>SOCK_STREAM</code> (TCP komunikace)</li>
<li><code>SOCK_DGRAM</code> (UDP datagramy)</li>
<li><code>SOCK_RAW</code> (Holá schránka bez žádného protokolu. Nutno vyplnit všechny
hlavičky ručně)</li>
</ol>
</div>

<div id="outline-container-org754c74c" class="outline-4">
<h4 id="org754c74c"><span class="section-number-4">4.3.1</span> Funkce v BSD socketech pro vytvoření konkurentního serveru TCP</h4>
<div class="outline-text-4" id="text-4-3-1">
<ol class="org-ol">
<li><code>socket()</code> &#x2013; Vytvoří schránku</li>
<li><code>bind()</code> &#x2013; Připojení schránky na lokální port</li>
<li><code>listen()</code> &#x2013; Vytrvoření fronty příchozích požadavků</li>
<li><code>accept()</code> &#x2013; Přijímání požadavků</li>
<li><code>fork()</code> &#x2013; Vytvoření synovského procesu</li>
<li><code>read(), write()</code> &#x2013; Výměna dat v rámci synovského procesu</li>
<li><code>close()</code> &#x2013; Zavření schránky synovského procesu</li>
<li><code>exit()</code> &#x2013; Ukončení synovského procesu</li>
<li><code>close()</code> &#x2013; Uzavření schránky rodičovského procesu</li>
</ol>
</div>
</div>

<div id="outline-container-orgfeb0671" class="outline-4">
<h4 id="orgfeb0671"><span class="section-number-4">4.3.2</span> UDP schránky</h4>
<div class="outline-text-4" id="text-4-3-2">
<p>
Když neběží UDP server, klient pošle zprávu pomocí <code>sendto()</code>, čeká na odpověď
pomocí <code>recvfrom()</code>. Dojde ale k uváznutí, protože UDP neposkytuje možnosti, jak
oznámit nedostupný port. Možná řešení jsou použití timeoutu nebo spojovaných UDP
schránek.
</p>

<p>
Spojované UDP schránky používají funkci <code>connect()</code>, nedochází ale k vytvoření
TCP spojení, pouze se zpracovávají chyby. Funkce <code>connect()</code> zjistí aktuální
stav serveru, v budoucnu však může dojít k ukončení činnosti UDP serveru a
klient to nezjístí. Funkce <code>connect()</code> se tak může volat opakovaně.
</p>
</div>
</div>
</div>
</div>
<div id="outline-container-org60ddafe" class="outline-2">
<h2 id="org60ddafe"><span class="section-number-2">5</span> Komunikace typu multicast</h2>
<div class="outline-text-2" id="text-5">
<p>
Jeden paket doručen skupině  uzlů v multicastové skupině. Používá se jedna
cílová adresa typu multicast. Pro IPv4 tato adresa náleží do třídy D, tedy
rozsah <code>22.0.0.0</code> &#x2013; <code>239.255.255.255</code>. Pro IPv6 se jedná o adresy s prefixem
<code>0xFF00::/8</code>.
</p>

<p>
Multicastová komunikace umožňuje dynamické připojování uzlů do multicastové
skupiny, speciální směrování multicastových adres a řízení dosahu multicastového
vysílání.
</p>

<p>
Pro výpis aktivních multicastových skupin existují příkazy:
</p>
<ul class="org-ul">
<li><code>ifmcstat</code> (FreeBSD)</li>
<li><code>netstat -g</code>, <code>netstat -gn</code> (Linux)</li>
<li><code>netsh interface ip show joins</code> (Windows)</li>
</ul>

<p>
Směrování IP multicastu je implementováno pomocí protokolů DVMRP, PIM, MOSPF.
Připojování uzlů do multicastových skupin probíhá pomocí protokolů IGMPv2,
IGMPv3, MLD.
</p>
</div>

<div id="outline-container-org88dc077" class="outline-3">
<h3 id="org88dc077"><span class="section-number-3">5.1</span> Mapování multicastové adresy IPv4 na MAC adresu</h3>
<div class="outline-text-3" id="text-5-1">
<p>
Prefix multicastové MAC adresy je <code>0x01 01 5e</code>. Z multicastové adresy se použije
jen posledních 23b  do multicastové MAC adresy. Může docházet k překrývání
adres.
</p>
</div>
</div>

<div id="outline-container-org198d141" class="outline-3">
<h3 id="org198d141"><span class="section-number-3">5.2</span> Mapování multicastové adresy IPv6 na MAC adresu</h3>
<div class="outline-text-3" id="text-5-2">
<p>
Nejnižších 32b IPv6 adresy je zkopírováno do MAC adresy, prefix multicastové
adresy MAC je <code>0x33 33</code>.
</p>
</div>
</div>
