ISA/main.org
** Vlastnosti multicastové komunikace
Posílá pouze UDP pakety, negarantuje spolehlivé doručení, zachování pořadí...
Multicastová adresa identifikuje skupinu síťových rozhraní. Členství ve skupině
je dynamické. Počítače se připojují a odpojují.

** Multicast a sockety
Podporované schránky jsou třídy ~AF_INET~ nebo ~AF_INET6~, typu ~SOCK_DGRAM~
nebo ~SOCK_RAW~. Multicastové datagramy mají implicitní TTL nastavenu na 1. Pro
vynucení multicastu na socketu se využívá funkce ~setsockopt()~. Konkrétně se
jedná o parametry ~IP_MULTICAST_IF~, ~IP_MULTICAST_TTL~, ~IP_MULTICAST_LOOP~.

Na straně klienta je třeba inicializovat rozhraní pro multicast pomocí naplnění
struktury ~struct ip_mreq~. Následně je možné se připojit do multicastové
skupiny voláním funkce ~setsockopt()~ s parametrem ~IP_ADD_MEMBERSHIP~ a
předáním vytvořené struktury. Pro odpojení od multicastové skupiny se používá
parametr ~IP_DROP_MEMBERSHIP~.

* Analýza paketů na linkové vrstvě
Zahrnuje zachycení paketů z přenosového média, převod binárních dat do
srozumitelné formy, rekonstrukci paketů, analýzu paketů, přenosů a konverzací.

** Nástroje pro zpracování paketů na linkové vrstvě
+ Paketový filtr BPF (BSD Packet Filter)
+ Linuxová implementace schránekt typu ~SOCK_PACKET~, ~PF_PACKET~.
+ Knihovna ~libpcap~
+ Knihovna ~scapy~ pro Python.

Tyto nástroje zajišťují přímý přístup k paketům na síťovém rozhraní. Aplikace
běží jako uživatelský proces mimo jádro systému v privilegovaném režimu. Pracuje
pouze s kopií paketu

** BSD Packet Filter
Řadič síťové karty zavolá BPF pokaždé, když je paket přijat nebo odeslán.
Aplikace nad BPF může filtrovat příchozí pakety, ty jsou uloženy v BPF bufferu.
Když je buffer plný nebo vyprší časovač, data jsou předána aplikaci.

** Knihovna ~libpcap~
Vytváří API pro zachytávání dat na síťpvém rozhraní. Čte data ze síťového
rozhraní nebo ze souboru ve formátu PCAP. Implementuje funkce pro zpracování
rámců a jejich analýzu. Původně určena pro jazyk C/C++, následně vytvořeny
wrappery pro další jazyky.

Čtení dat probíhá v následující posloupnosti:
1. Připojení k síťovému rozhraní ~pcap_lookupdev()~.
2. Otevření rozhraní pro čtení ~pcap_open_live()~, ~pcap_open_offline()~ (pro PCAP)
3. Čtení paketů ~pcap_dispatch()~, ~pcap_loop()~, ~pcap_next()~
4. Analýzu paketů provádí aplikace.


* Zabezpečení počítačových sítí
V počítačových sítích existují rizika:
+ Odposlech přenášených dat
+ Neautorizovaný přístup k zařízením
+ Podvržení zprávy
+ Falšování identity
+ Útok na systém (DoS)
+ Škodlivý software

Exisutjí požadavky na bezpečnost:
+ Důvěrnost
+ Autentizace
+ Integrita dat
+ Neodmítnutelnost
+ Dostupnost, kontrola přístupu

* Symetrické šifrování s tajným klíčem
Slouží pro zajištění důvěrnosti. Pro šifrování a dešifrování se používá stejný
klíč. Doporučená délka klíče je 112 -- 256 bitů.

** Rovnice pro symetrické šifrování
Pro šifrování platí vztah:

\begin{equation}
E_k(M) = C
\end{equation}

Kde $E_k$ je šifrovací funkce s klíčem $K$, $M$ je vstupní zpráva.

Pro dešifrování platí vztah:

\begin{equation}
D_k(C) = M
\end{equation}

Kde $D_k$ je dešifrovací funkce s klíčem $K$.

** Bezpečnost symetrického šifrování
Bezpečnost symetrického šifrování spočívá v klíči, nikoliv v principu algoritmu
(ten je většinou zveřejněný). Šifrují se buď jednotlivé bity zprávy (proudová
šifra) nebo sekvence bitů o pevné velikosti (bloková šifra).

** Výhody a nevýhody
Symetrické šifrování má problém s nutností distribuce klíčů a rozšiřitelností.
Naopak výhodou je rychlý výpočet.

** Příklady symetrických šifrovacích algoritmů
*** Blokové
+ DES
+ 3DES
+ AES
+ IDEA
+ RC2/4/5/6
+ Blowfish

*** Proudové
+ DES
+ 3DES
+ RC4
+ SEAL

** Nástroje pro symetrické šifrování
Nejpoužívanější je nástroj ~openssl enc~. Obsahuje sadu šifrovacích a
dešifrovacích algoritmů.

* Asymetrické šifrování s veřejným klíčem
Slouží pro zajištění důvěrnosti a autentizaci.

** Princip
Příjemce vygeneruje dva klíče:
1. Veřejný klíč $KB_{pub}$ pro šifrování
2. Soukromý klíč $KB_{sec}$ pro dešifrování

Klíč pro šifrování se liší od klíče pro dešifrování. Doporučená dékla klíče je
2048 -- 4096 bitů. Soukromý klíč se nedá odvodit z veřejného.

** Rovnice pro asymetrické šifrování
*** Šifrování
\begin{equation}
E_{KB_{pub}}(M) = C
\end{equation}

Může provést kdokoliv veřejným klíčem příjemce.

*** Dešifrování
\begin{equation}
D_{KB_{sec}}(C) = M
\end{equation}

Může provést pouze příjemce svým soukromým klíčem.

** Výhody a nevýhody
Snadná rozšiřitelnost, protože veřejný klíč lze vystavit veřejně. Náročné na
výpočet kvůli použití dlouhého klíče. Problém s ověřením pravosti veřejného
klíče, vyžaduje certifikační autoritu.

** Příklady asymetrických šifrovacích algoritmů
+ RSA
+ ElGamal
+ Eliptic curve
+ Diffie-Hellman

** Nástroje pro asymetrické šifrování
Používají se nástroje ~openssl genpkey~, ~openssl pkeyutl~, ~opoenssl rsa~.
Soukromé klíče je možné ochránit symetrickou šifrou proti zneužití.

