ISA/main.html

<div id="outline-container-org0c60a3d" class="outline-3">
<h3 id="org0c60a3d"><span class="section-number-3">5.3</span> Vlastnosti multicastové komunikace</h3>
<div class="outline-text-3" id="text-5-3">
<p>
Posílá pouze UDP pakety, negarantuje spolehlivé doručení, zachování pořadí&#x2026;
Multicastová adresa identifikuje skupinu síťových rozhraní. Členství ve skupině
je dynamické. Počítače se připojují a odpojují.
</p>
</div>
</div>

<div id="outline-container-orgb048088" class="outline-3">
<h3 id="orgb048088"><span class="section-number-3">5.4</span> Multicast a sockety</h3>
<div class="outline-text-3" id="text-5-4">
<p>
Podporované schránky jsou třídy <code>AF_INET</code> nebo <code>AF_INET6</code>, typu <code>SOCK_DGRAM</code>
nebo <code>SOCK_RAW</code>. Multicastové datagramy mají implicitní TTL nastavenu na 1. Pro
vynucení multicastu na socketu se využívá funkce <code>setsockopt()</code>. Konkrétně se
jedná o parametry <code>IP_MULTICAST_IF</code>, <code>IP_MULTICAST_TTL</code>, <code>IP_MULTICAST_LOOP</code>.
</p>

<p>
Na straně klienta je třeba inicializovat rozhraní pro multicast pomocí naplnění
struktury <code>struct ip_mreq</code>. Následně je možné se připojit do multicastové
skupiny voláním funkce <code>setsockopt()</code> s parametrem <code>IP_ADD_MEMBERSHIP</code> a
předáním vytvořené struktury. Pro odpojení od multicastové skupiny se používá
parametr <code>IP_DROP_MEMBERSHIP</code>.
</p>
</div>
</div>
</div>

<div id="outline-container-org8c38f89" class="outline-2">
<h2 id="org8c38f89"><span class="section-number-2">6</span> Analýza paketů na linkové vrstvě</h2>
<div class="outline-text-2" id="text-6">
<p>
Zahrnuje zachycení paketů z přenosového média, převod binárních dat do
srozumitelné formy, rekonstrukci paketů, analýzu paketů, přenosů a konverzací.
</p>
</div>

<div id="outline-container-org4bb4f40" class="outline-3">
<h3 id="org4bb4f40"><span class="section-number-3">6.1</span> Nástroje pro zpracování paketů na linkové vrstvě</h3>
<div class="outline-text-3" id="text-6-1">
<ul class="org-ul">
<li>Paketový filtr BPF (BSD Packet Filter)</li>
<li>Linuxová implementace schránekt typu <code>SOCK_PACKET</code>, <code>PF_PACKET</code>.</li>
<li>Knihovna <code>libpcap</code></li>
<li>Knihovna <code>scapy</code> pro Python.</li>
</ul>

<p>
Tyto nástroje zajišťují přímý přístup k paketům na síťovém rozhraní. Aplikace
běží jako uživatelský proces mimo jádro systému v privilegovaném režimu. Pracuje
pouze s kopií paketu
</p>
</div>
</div>

<div id="outline-container-org43206c6" class="outline-3">
<h3 id="org43206c6"><span class="section-number-3">6.2</span> BSD Packet Filter</h3>
<div class="outline-text-3" id="text-6-2">
<p>
Řadič síťové karty zavolá BPF pokaždé, když je paket přijat nebo odeslán.
Aplikace nad BPF může filtrovat příchozí pakety, ty jsou uloženy v BPF bufferu.
Když je buffer plný nebo vyprší časovač, data jsou předána aplikaci.
</p>
</div>
</div>

<div id="outline-container-org6f33d08" class="outline-3">
<h3 id="org6f33d08"><span class="section-number-3">6.3</span> Knihovna <code>libpcap</code></h3>
<div class="outline-text-3" id="text-6-3">
<p>
Vytváří API pro zachytávání dat na síťpvém rozhraní. Čte data ze síťového
rozhraní nebo ze souboru ve formátu PCAP. Implementuje funkce pro zpracování
rámců a jejich analýzu. Původně určena pro jazyk C/C++, následně vytvořeny
wrappery pro další jazyky.
</p>

<p>
Čtení dat probíhá v následující posloupnosti:
</p>
<ol class="org-ol">
<li>Připojení k síťovému rozhraní <code>pcap_lookupdev()</code>.</li>
<li>Otevření rozhraní pro čtení <code>pcap_open_live()</code>, <code>pcap_open_offline()</code> (pro PCAP)</li>
<li>Čtení paketů <code>pcap_dispatch()</code>, <code>pcap_loop()</code>, <code>pcap_next()</code></li>
<li>Analýzu paketů provádí aplikace.</li>
</ol>
</div>
</div>
</div>


<div id="outline-container-orga11e807" class="outline-2">
<h2 id="orga11e807"><span class="section-number-2">7</span> Zabezpečení počítačových sítí</h2>
<div class="outline-text-2" id="text-7">
<p>
V počítačových sítích existují rizika:
</p>
<ul class="org-ul">
<li>Odposlech přenášených dat</li>
<li>Neautorizovaný přístup k zařízením</li>
<li>Podvržení zprávy</li>
<li>Falšování identity</li>
<li>Útok na systém (DoS)</li>
<li>Škodlivý software</li>
</ul>

<p>
Exisutjí požadavky na bezpečnost:
</p>
<ul class="org-ul">
<li>Důvěrnost</li>
<li>Autentizace</li>
<li>Integrita dat</li>
<li>Neodmítnutelnost</li>
<li>Dostupnost, kontrola přístupu</li>
</ul>
</div>
</div>

<div id="outline-container-org2f552c7" class="outline-2">
<h2 id="org2f552c7"><span class="section-number-2">8</span> Symetrické šifrování s tajným klíčem</h2>
<div class="outline-text-2" id="text-8">
<p>
Slouží pro zajištění důvěrnosti. Pro šifrování a dešifrování se používá stejný
klíč. Doporučená délka klíče je 112 &#x2013; 256 bitů.
</p>
</div>

<div id="outline-container-orga528003" class="outline-3">
<h3 id="orga528003"><span class="section-number-3">8.1</span> Rovnice pro symetrické šifrování</h3>
<div class="outline-text-3" id="text-8-1">
<p>
Pro šifrování platí vztah:
</p>

\begin{equation}
E_k(M) = C
\end{equation}

<p>
Kde \(E_k\) je šifrovací funkce s klíčem \(K\), \(M\) je vstupní zpráva.
</p>

<p>
Pro dešifrování platí vztah:
</p>

\begin{equation}
D_k(C) = M
\end{equation}

<p>
Kde \(D_k\) je dešifrovací funkce s klíčem \(K\).
</p>
</div>
</div>

<div id="outline-container-org45d44f5" class="outline-3">
<h3 id="org45d44f5"><span class="section-number-3">8.2</span> Bezpečnost symetrického šifrování</h3>
<div class="outline-text-3" id="text-8-2">
<p>
Bezpečnost symetrického šifrování spočívá v klíči, nikoliv v principu algoritmu
(ten je většinou zveřejněný). Šifrují se buď jednotlivé bity zprávy (proudová
šifra) nebo sekvence bitů o pevné velikosti (bloková šifra).
</p>
</div>
</div>

<div id="outline-container-org217549f" class="outline-3">
<h3 id="org217549f"><span class="section-number-3">8.3</span> Výhody a nevýhody</h3>
<div class="outline-text-3" id="text-8-3">
<p>
Symetrické šifrování má problém s nutností distribuce klíčů a rozšiřitelností.
Naopak výhodou je rychlý výpočet.
</p>
</div>
</div>

<div id="outline-container-org95c0498" class="outline-3">
<h3 id="org95c0498"><span class="section-number-3">8.4</span> Příklady symetrických šifrovacích algoritmů</h3>
<div class="outline-text-3" id="text-8-4">
</div>
<div id="outline-container-org2c65bd6" class="outline-4">
<h4 id="org2c65bd6"><span class="section-number-4">8.4.1</span> Blokové</h4>
<div class="outline-text-4" id="text-8-4-1">
<ul class="org-ul">
<li>DES</li>
<li>3DES</li>
<li>AES</li>
<li>IDEA</li>
<li>RC2/4/5/6</li>
<li>Blowfish</li>
</ul>
</div>
</div>

<div id="outline-container-orga0bf812" class="outline-4">
<h4 id="orga0bf812"><span class="section-number-4">8.4.2</span> Proudové</h4>
<div class="outline-text-4" id="text-8-4-2">
<ul class="org-ul">
<li>DES</li>
<li>3DES</li>
<li>RC4</li>
<li>SEAL</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org265a58a" class="outline-3">
<h3 id="org265a58a"><span class="section-number-3">8.5</span> Nástroje pro symetrické šifrování</h3>
<div class="outline-text-3" id="text-8-5">
<p>
Nejpoužívanější je nástroj <code>openssl enc</code>. Obsahuje sadu šifrovacích a
dešifrovacích algoritmů.
</p>
</div>
</div>
</div>

<div id="outline-container-orgad06679" class="outline-2">
<h2 id="orgad06679"><span class="section-number-2">9</span> Asymetrické šifrování s veřejným klíčem</h2>
<div class="outline-text-2" id="text-9">
<p>
Slouží pro zajištění důvěrnosti a autentizaci.
</p>
</div>

<div id="outline-container-orgb9f167a" class="outline-3">
<h3 id="orgb9f167a"><span class="section-number-3">9.1</span> Princip</h3>
<div class="outline-text-3" id="text-9-1">
<p>
Příjemce vygeneruje dva klíče:
</p>
<ol class="org-ol">
<li>Veřejný klíč \(KB_{pub}\) pro šifrování</li>
<li>Soukromý klíč \(KB_{sec}\) pro dešifrování</li>
</ol>

<p>
Klíč pro šifrování se liší od klíče pro dešifrování. Doporučená dékla klíče je
2048 &#x2013; 4096 bitů. Soukromý klíč se nedá odvodit z veřejného.
</p>
</div>
</div>

<div id="outline-container-orgf8ec83d" class="outline-3">
<h3 id="orgf8ec83d"><span class="section-number-3">9.2</span> Rovnice pro asymetrické šifrování</h3>
<div class="outline-text-3" id="text-9-2">
</div>
<div id="outline-container-orgd1644b4" class="outline-4">
<h4 id="orgd1644b4"><span class="section-number-4">9.2.1</span> Šifrování</h4>
<div class="outline-text-4" id="text-9-2-1">
\begin{equation}
E_{KB_{pub}}(M) = C
\end{equation}

<p>
Může provést kdokoliv veřejným klíčem příjemce.
</p>
</div>
</div>

<div id="outline-container-orgb88b64a" class="outline-4">
<h4 id="orgb88b64a"><span class="section-number-4">9.2.2</span> Dešifrování</h4>
<div class="outline-text-4" id="text-9-2-2">
\begin{equation}
D_{KB_{sec}}(C) = M
\end{equation}

<p>
Může provést pouze příjemce svým soukromým klíčem.
</p>
</div>
</div>
</div>

<div id="outline-container-org9e17e2e" class="outline-3">
<h3 id="org9e17e2e"><span class="section-number-3">9.3</span> Výhody a nevýhody</h3>
<div class="outline-text-3" id="text-9-3">
<p>
Snadná rozšiřitelnost, protože veřejný klíč lze vystavit veřejně. Náročné na
výpočet kvůli použití dlouhého klíče. Problém s ověřením pravosti veřejného
klíče, vyžaduje certifikační autoritu.
</p>
</div>
</div>

<div id="outline-container-org782f7d2" class="outline-3">
<h3 id="org782f7d2"><span class="section-number-3">9.4</span> Příklady asymetrických šifrovacích algoritmů</h3>
<div class="outline-text-3" id="text-9-4">
<ul class="org-ul">
<li>RSA</li>
<li>ElGamal</li>
<li>Eliptic curve</li>
<li>Diffie-Hellman</li>
</ul>
</div>
</div>

<div id="outline-container-org2a5fe6c" class="outline-3">
<h3 id="org2a5fe6c"><span class="section-number-3">9.5</span> Nástroje pro asymetrické šifrování</h3>
<div class="outline-text-3" id="text-9-5">
<p>
Používají se nástroje <code>openssl genpkey</code>, <code>openssl pkeyutl</code>, <code>opoenssl rsa</code>.
Soukromé klíče je možné ochránit symetrickou šifrou proti zneužití.
</p>
</div>
</div>
</div>
