ISA/main.org
* Zajíštění integrity dat pomocí kryptografického hashe
Zajišťuje integritu zprávy pomocí tajného klíče. Využívá kryptografickou
hashovací funkci, např. MD4/5/6, SHA1/2/3. Ta vytvoří kryptografický hash MAC
(Message Authentication Code) o pevné délce. Mechanismus HMAC přidává navíc do
výpočtu tajný klíč.

V počítačových sítích se používá hashování pro autentizaci směrovacích zpráv,
při použití TLS, PGP, SSH, IPSec nebo pro autentizaci zpráv SMMPv3.

** Nástroje pro hashování
+ ~md5~
+ ~sha1~
+ ~sha256~
+ ~sha384~
+ ~sha512~
+ ~shasum~
+ ~openssl dgst~

* Elektronický podpis
Využívá asymetrické kryprografie pro ověření odesilatele pomocí jeho soukromého
klíče.

** Princip a rovnice
Odesilatel A si vygeneruje dvojici klíčů $KA_{sec}$ a $KA_{pub}$.

*** Podepsání

\begin{equation}
E_{KA_{sec}}(MD) = DS
\end{equation}

Kde $E$ je šifrovací funkce, $MD$ (Message Digest) je hash dokumentu a $DS$ je
elektronický podpis.

*** Ověření podpisu
Příjemce vypočítá hash dokumentu $MD'$ a porovná s dešifrovaným podpisem:

\begin{equation}
E_{KA_{pub}}(DS) = MD
\end{equation}

** Příklady algoritmů
+ RSA
+ DSA
+ Elliptic Curve DSA

** Používání elektronického podpisu
Pro používání elektronických podpisů je zřízen systém /Public Key
Infrastructure/, což je systém certifikačních autorit pro správu, uložení a
ověření veřejných klíčů. CA generuje, podepisuje, ukládá a ověřuje certifikáty k
veřejným klíčům. Ověřuje identitu uživatelů, aplikací nebo organizací a vytváří
vazbu s veřejným klíčem.

* Digitální certifikát X.509
Dokument ověřující platnost pravého veřejného klíče a příslušnost k danému
uživateli. Certifikát vydává a ověřuje certifikační autorita. Pro ověření
podpisu CA se používá certifikát kořenové CA. K ověření slouží protokol OSCP
(Online Certificate Status Protocol).

** Obsah certifikátu X.509
+ Sériové číslo
+ Identifikace vydavatele (Distinguished Name: DN)
+ Datum platnosti
+ Identifikace majitele (DN)
+ Veřejný klíč majitele
+ Účel veřejného klíče (šifrování, ověřování podpisů)
+ Podpis certifikátu podepsaný soukromým klíčem CA
+ Algoritmus pro vytvoření podpisu
+ Otisk certifikátu (hash)
+ Algoritmus pro vytvoření hashe
+ Odkaz na seznam revokovaných certifikátů (CRL)

** Použití digitálních certifikátů
+ Bezpečný transport SSL/TLS
+ Zapezpečení IPSec
+ HTTPS
+ S/MIME
+ Autentizace uživatelů pomocí 802.1x

* Diffie-Hellman
Asymetrický algoritmus pro vytvoření sdíleného tajného klíče přes nezabezpečený
kanál založený na umocňování čísel, kde $(A^B)^C = (A^C)^B$. Nevyžaduje
šifrování.

** Postup
1. Uzly A a B se veřejně dohodnou na použitém modulu $m$ a základu $z$.
2. Uzel A si zvolí tajné číslo $a$.
3. Uzel A pošle veřejně uzlu B hodnotu $x = z^a mod m$.
4. Uzel B si zvolí tajné číslo $b$.
5. Uzel B pošle uzlu A hodnotu $y = z^b mod m$.
6. Uzel A určí klíč $k = y^a mod m$.
7. Uzel B spočítá klíč $k = x^b mod m$.
8. Klíč $k$ se v uzlech A a B rovná.

* Zabezpečení komunikace na modelu TCP/IP
Nezávislé zabezpečení dat na jednotlivých vrstvách TCP/IP. Každý mechanismus
vyžaduje vytvoření a distribuci klíčů, jejich zabezpečení a ověření. Dosah
zabezpečení závisí na typu vrstvy.

* Transport Layer Security (TLS)
Komunikuje nad transportní vrstvou v TCP paketech. Zapezpečuje přenos dat
protokolů aplikační vrstvy. Zajišťuje důvěrnost, integritu dat a autentizaci
klienta či serveru.

** TLS Handshake
1. Client Hello -- Klient posílá informace o podporovaných šifrách, verzi TLS
2. Server Hello -- Server posílá informace
3. Server Certificate -- Server sděluje informace o certifikátech
4. Server Key Exchange -- Server zahajuje výměnu klíčů
5. Client Certificate -- Klientský certifikát
6. Client Key Exchange -- Klient opětuje výměnu klíčů
7. Client Certificate Verify -- Klient verifikuje certifikát serveru
8. Client Change Cipher Spec -- Klient mění používanou šifru
9. Server Change Cipher Spec -- Server mění používanou šifru
10. Encrypted application data -- Tok šifrovaných aplikačních dat

Pro výměnu klíčů se používý asymetrická kryptografie (Diffie-Hellman, RSA,
Elliptic Curve).

Pro šifrování dat se využívá symetrická kryptografie (je rychlejší).

** Vlastnosti
+ Šifrování: obě strany majá vygenerovaný tajný klíč
+ Autentizace: obě strany si navzájem  vyění a ověří certifikáty
+ Integrita dat: šifrovaná data obsahují hash
+ Šifrovaná data obsahují sekvenční číslo jako prevenci proti přehrání
+ Před zašifrováním mohou být data komprimována

** Omezení TLS
TLS vyžaduje ověřený certifikát serveru, jinak je možný útok Man in the middle.
Nezajišťuje autentizaci odesilatele. Problematická implementace na zařízeních s
omezenými prostředky (IoT). Problém při potřebě monitorovat provoz.

* IPSec
Zabezpečuje přenos pro IPv4 a IPv6. Zajišťuje autentizaci (RSA), šifrování a
integritu dat. Využívá protokoly AH (Authentication Header) a ESP (Encapsulation
Security Payload). Pracuje ve dvou režimech: tunelovacím a transtortním.
Parametry spojení se ukládají do databáze VPN spojení SA (Security Association).

** Protokol AH (Authentication Header)
Chrání datagram IP pomocí kryptografického hashe HMAC-MD nebo HMAC-SHA. Hash se
počítá nad položkami hlavičky, které se během cesty nemění. Zajišťuje
autentizaci, integritu dat a chrání proti přehrání. Nezajišťuje důvěrnost dat.

** Protokol ESP (Encapsulation Security Protocol)
Zapouzdřuje a chrání data IP datagramu. Zajišťuje autentizaci, důvěrnost a
integritu dat, chrání proti přehrátí. Nezajišťuje ochranu vnější hlavičky IP.
Pro šifrování využívá DES, 3DES, AES. Pro autentizaci a integritu dat využívá
HMAC.

