ISA/main.html

<div id="outline-container-org2946b99" class="outline-2">
<h2 id="org2946b99"><span class="section-number-2">10</span> Zajíštění integrity dat pomocí kryptografického hashe</h2>
<div class="outline-text-2" id="text-10">
<p>
Zajišťuje integritu zprávy pomocí tajného klíče. Využívá kryptografickou
hashovací funkci, např. MD4/5/6, SHA1/2/3. Ta vytvoří kryptografický hash MAC
(Message Authentication Code) o pevné délce. Mechanismus HMAC přidává navíc do
výpočtu tajný klíč.
</p>

<p>
V počítačových sítích se používá hashování pro autentizaci směrovacích zpráv,
při použití TLS, PGP, SSH, IPSec nebo pro autentizaci zpráv SMMPv3.
</p>
</div>

<div id="outline-container-org9d889ce" class="outline-3">
<h3 id="org9d889ce"><span class="section-number-3">10.1</span> Nástroje pro hashování</h3>
<div class="outline-text-3" id="text-10-1">
<ul class="org-ul">
<li><code>md5</code></li>
<li><code>sha1</code></li>
<li><code>sha256</code></li>
<li><code>sha384</code></li>
<li><code>sha512</code></li>
<li><code>shasum</code></li>
<li><code>openssl dgst</code></li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orge904c5d" class="outline-2">
<h2 id="orge904c5d"><span class="section-number-2">11</span> Elektronický podpis</h2>
<div class="outline-text-2" id="text-11">
<p>
Využívá asymetrické kryprografie pro ověření odesilatele pomocí jeho soukromého
klíče.
</p>
</div>

<div id="outline-container-org0bb0773" class="outline-3">
<h3 id="org0bb0773"><span class="section-number-3">11.1</span> Princip a rovnice</h3>
<div class="outline-text-3" id="text-11-1">
<p>
Odesilatel A si vygeneruje dvojici klíčů \(KA_{sec}\) a \(KA_{pub}\).
</p>
</div>

<div id="outline-container-org96ca51e" class="outline-4">
<h4 id="org96ca51e"><span class="section-number-4">11.1.1</span> Podepsání</h4>
<div class="outline-text-4" id="text-11-1-1">
\begin{equation}
E_{KA_{sec}}(MD) = DS
\end{equation}

<p>
Kde \(E\) je šifrovací funkce, \(MD\) (Message Digest) je hash dokumentu a \(DS\) je
elektronický podpis.
</p>
</div>
</div>

<div id="outline-container-org153b863" class="outline-4">
<h4 id="org153b863"><span class="section-number-4">11.1.2</span> Ověření podpisu</h4>
<div class="outline-text-4" id="text-11-1-2">
<p>
Příjemce vypočítá hash dokumentu \(MD'\) a porovná s dešifrovaným podpisem:
</p>

\begin{equation}
E_{KA_{pub}}(DS) = MD
\end{equation}
</div>
</div>
</div>

<div id="outline-container-org5f17fe1" class="outline-3">
<h3 id="org5f17fe1"><span class="section-number-3">11.2</span> Příklady algoritmů</h3>
<div class="outline-text-3" id="text-11-2">
<ul class="org-ul">
<li>RSA</li>
<li>DSA</li>
<li>Elliptic Curve DSA</li>
</ul>
</div>
</div>

<div id="outline-container-org3300071" class="outline-3">
<h3 id="org3300071"><span class="section-number-3">11.3</span> Používání elektronického podpisu</h3>
<div class="outline-text-3" id="text-11-3">
<p>
Pro používání elektronických podpisů je zřízen systém <i>Public Key
Infrastructure</i>, což je systém certifikačních autorit pro správu, uložení a
ověření veřejných klíčů. CA generuje, podepisuje, ukládá a ověřuje certifikáty k
veřejným klíčům. Ověřuje identitu uživatelů, aplikací nebo organizací a vytváří
vazbu s veřejným klíčem.
</p>
</div>
</div>
</div>

<div id="outline-container-org9118bc4" class="outline-2">
<h2 id="org9118bc4"><span class="section-number-2">12</span> Digitální certifikát X.509</h2>
<div class="outline-text-2" id="text-12">
<p>
Dokument ověřující platnost pravého veřejného klíče a příslušnost k danému
uživateli. Certifikát vydává a ověřuje certifikační autorita. Pro ověření
podpisu CA se používá certifikát kořenové CA. K ověření slouží protokol OSCP
(Online Certificate Status Protocol).
</p>
</div>

<div id="outline-container-org293b713" class="outline-3">
<h3 id="org293b713"><span class="section-number-3">12.1</span> Obsah certifikátu X.509</h3>
<div class="outline-text-3" id="text-12-1">
<ul class="org-ul">
<li>Sériové číslo</li>
<li>Identifikace vydavatele (Distinguished Name: DN)</li>
<li>Datum platnosti</li>
<li>Identifikace majitele (DN)</li>
<li>Veřejný klíč majitele</li>
<li>Účel veřejného klíče (šifrování, ověřování podpisů)</li>
<li>Podpis certifikátu podepsaný soukromým klíčem CA</li>
<li>Algoritmus pro vytvoření podpisu</li>
<li>Otisk certifikátu (hash)</li>
<li>Algoritmus pro vytvoření hashe</li>
<li>Odkaz na seznam revokovaných certifikátů (CRL)</li>
</ul>
</div>
</div>

<div id="outline-container-org2464270" class="outline-3">
<h3 id="org2464270"><span class="section-number-3">12.2</span> Použití digitálních certifikátů</h3>
<div class="outline-text-3" id="text-12-2">
<ul class="org-ul">
<li>Bezpečný transport SSL/TLS</li>
<li>Zapezpečení IPSec</li>
<li>HTTPS</li>
<li>S/MIME</li>
<li>Autentizace uživatelů pomocí 802.1x</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org3dc3b0e" class="outline-2">
<h2 id="org3dc3b0e"><span class="section-number-2">13</span> Diffie-Hellman</h2>
<div class="outline-text-2" id="text-13">
<p>
Asymetrický algoritmus pro vytvoření sdíleného tajného klíče přes nezabezpečený
kanál založený na umocňování čísel, kde \((A^B)^C = (A^C)^B\). Nevyžaduje
šifrování.
</p>
</div>

<div id="outline-container-orgebcb0e8" class="outline-3">
<h3 id="orgebcb0e8"><span class="section-number-3">13.1</span> Postup</h3>
<div class="outline-text-3" id="text-13-1">
<ol class="org-ol">
<li>Uzly A a B se veřejně dohodnou na použitém modulu \(m\) a základu \(z\).</li>
<li>Uzel A si zvolí tajné číslo \(a\).</li>
<li>Uzel A pošle veřejně uzlu B hodnotu \(x = z^a mod m\).</li>
<li>Uzel B si zvolí tajné číslo \(b\).</li>
<li>Uzel B pošle uzlu A hodnotu \(y = z^b mod m\).</li>
<li>Uzel A určí klíč \(k = y^a mod m\).</li>
<li>Uzel B spočítá klíč \(k = x^b mod m\).</li>
<li>Klíč \(k\) se v uzlech A a B rovná.</li>
</ol>
</div>
</div>
</div>

<div id="outline-container-org010b719" class="outline-2">
<h2 id="org010b719"><span class="section-number-2">14</span> Zabezpečení komunikace na modelu TCP/IP</h2>
<div class="outline-text-2" id="text-14">
<p>
Nezávislé zabezpečení dat na jednotlivých vrstvách TCP/IP. Každý mechanismus
vyžaduje vytvoření a distribuci klíčů, jejich zabezpečení a ověření. Dosah
zabezpečení závisí na typu vrstvy.
</p>
</div>
</div>

<div id="outline-container-orgc094fba" class="outline-2">
<h2 id="orgc094fba"><span class="section-number-2">15</span> Transport Layer Security (TLS)</h2>
<div class="outline-text-2" id="text-15">
<p>
Komunikuje nad transportní vrstvou v TCP paketech. Zapezpečuje přenos dat
protokolů aplikační vrstvy. Zajišťuje důvěrnost, integritu dat a autentizaci
klienta či serveru.
</p>
</div>

<div id="outline-container-org1988b78" class="outline-3">
<h3 id="org1988b78"><span class="section-number-3">15.1</span> TLS Handshake</h3>
<div class="outline-text-3" id="text-15-1">
<ol class="org-ol">
<li>Client Hello &#x2013; Klient posílá informace o podporovaných šifrách, verzi TLS</li>
<li>Server Hello &#x2013; Server posílá informace</li>
<li>Server Certificate &#x2013; Server sděluje informace o certifikátech</li>
<li>Server Key Exchange &#x2013; Server zahajuje výměnu klíčů</li>
<li>Client Certificate &#x2013; Klientský certifikát</li>
<li>Client Key Exchange &#x2013; Klient opětuje výměnu klíčů</li>
<li>Client Certificate Verify &#x2013; Klient verifikuje certifikát serveru</li>
<li>Client Change Cipher Spec &#x2013; Klient mění používanou šifru</li>
<li>Server Change Cipher Spec &#x2013; Server mění používanou šifru</li>
<li>Encrypted application data &#x2013; Tok šifrovaných aplikačních dat</li>
</ol>

<p>
Pro výměnu klíčů se používý asymetrická kryptografie (Diffie-Hellman, RSA,
Elliptic Curve).
</p>

<p>
Pro šifrování dat se využívá symetrická kryptografie (je rychlejší).
</p>
</div>
</div>

<div id="outline-container-org8d28dde" class="outline-3">
<h3 id="org8d28dde"><span class="section-number-3">15.2</span> Vlastnosti</h3>
<div class="outline-text-3" id="text-15-2">
<ul class="org-ul">
<li>Šifrování: obě strany majá vygenerovaný tajný klíč</li>
<li>Autentizace: obě strany si navzájem  vyění a ověří certifikáty</li>
<li>Integrita dat: šifrovaná data obsahují hash</li>
<li>Šifrovaná data obsahují sekvenční číslo jako prevenci proti přehrání</li>
<li>Před zašifrováním mohou být data komprimována</li>
</ul>
</div>
</div>

<div id="outline-container-orgf8d244c" class="outline-3">
<h3 id="orgf8d244c"><span class="section-number-3">15.3</span> Omezení TLS</h3>
<div class="outline-text-3" id="text-15-3">
<p>
TLS vyžaduje ověřený certifikát serveru, jinak je možný útok Man in the middle.
Nezajišťuje autentizaci odesilatele. Problematická implementace na zařízeních s
omezenými prostředky (IoT). Problém při potřebě monitorovat provoz.
</p>
</div>
</div>
</div>

<div id="outline-container-orgaa4fb83" class="outline-2">
<h2 id="orgaa4fb83"><span class="section-number-2">16</span> IPSec</h2>
<div class="outline-text-2" id="text-16">
<p>
Zabezpečuje přenos pro IPv4 a IPv6. Zajišťuje autentizaci (RSA), šifrování a
integritu dat. Využívá protokoly AH (Authentication Header) a ESP (Encapsulation
Security Payload). Pracuje ve dvou režimech: tunelovacím a transtortním.
Parametry spojení se ukládají do databáze VPN spojení SA (Security Association).
</p>
</div>

<div id="outline-container-orga8d9555" class="outline-3">
<h3 id="orga8d9555"><span class="section-number-3">16.1</span> Protokol AH (Authentication Header)</h3>
<div class="outline-text-3" id="text-16-1">
<p>
Chrání datagram IP pomocí kryptografického hashe HMAC-MD nebo HMAC-SHA. Hash se
počítá nad položkami hlavičky, které se během cesty nemění. Zajišťuje
autentizaci, integritu dat a chrání proti přehrání. Nezajišťuje důvěrnost dat.
</p>
</div>
</div>

<div id="outline-container-org13ff68a" class="outline-3">
<h3 id="org13ff68a"><span class="section-number-3">16.2</span> Protokol ESP (Encapsulation Security Protocol)</h3>
<div class="outline-text-3" id="text-16-2">
<p>
Zapouzdřuje a chrání data IP datagramu. Zajišťuje autentizaci, důvěrnost a
integritu dat, chrání proti přehrátí. Nezajišťuje ochranu vnější hlavičky IP.
Pro šifrování využívá DES, 3DES, AES. Pro autentizaci a integritu dat využívá
HMAC.
</p>
</div>
</div>
</div>
