ISA/main.html

<div id="outline-container-org94d7e60" class="outline-2">
<h2 id="org94d7e60"><span class="section-number-2">17</span> Zabezpečení emailových zpráv pomocí PGP (Pretty Good Privacy)</h2>
<div class="outline-text-2" id="text-17">
<p>
Zajišťuje integritu dat (MD5), autentizaci odesilatele (RSA) i šifrování (IDEA).
Zpráva je podepsána soukromým klíčem odesilatele. Zpráva je zašifrována tajným
klíčem. Tajný klíč je zašifrován veřejným klíčem příjemce a připojen ke zprávě.
Odesilatel musí mít přístup k veřejnému klíči přijemce pro zašifrování zprávy.
Příjemce musí mít přístup k veřejnému klíči odesilatele pro ověření identity.
</p>
</div>
</div>

<div id="outline-container-orgfa701b8" class="outline-2">
<h2 id="orgfa701b8"><span class="section-number-2">18</span> Autentizace zpráv směrovacího protokolu OSPF</h2>
<div class="outline-text-2" id="text-18">
<p>
Protokol je zapouzdřen v IP. Využívá krypto hash MD5 a sdílený tajný klíč.
Používá sekvenční číslo proti přehrání podepsaného paketu. Vstupem pro
algoritmus MD5 je celý paket OSPF a tajný klíč. Pro OSPFv2 je použít pro
autentizaci algoritmus HMAC-SHA
</p>
</div>
</div>

<div id="outline-container-org9ac5b7c" class="outline-2">
<h2 id="org9ac5b7c"><span class="section-number-2">19</span> Domain Name System</h2>
<div class="outline-text-2" id="text-19">
<p>
DNS je globální adresář názvů počítačů a dalších identifikátorů síťových
zařízení a služeb
</p>

<p>
DNS je tvořeno:
</p>
<ol class="org-ol">
<li>Jmenným prostorem DNS adres a mapování adres na IP adresy</li>
<li>Uložení prostoru jmen DNS a správa tohoto prostoru</li>
<li>Přístup k datům v DNS a vyhledávání</li>
</ol>

<p>
DNS je implementováno pomocí hierarchického rozdělení prostoru doménových jmen.
Globální databáze DNS jmen je distribuována na servery. Pro DNS existuje
stejnojmenný protokol, který přenáší data rezolucí DNS a přenosů zón.
</p>

<p>
Hierarchické uspořádání je ve formě inverzního stromu.
</p>

<p>
Pro vyhledání doménového jména dle IP adresy je vytvořena speciální doména
<code>arpa</code>, která uchovává mapování.
</p>
</div>

<div id="outline-container-org1daa7ed" class="outline-3">
<h3 id="org1daa7ed"><span class="section-number-3">19.1</span> Správa domén</h3>
<div class="outline-text-3" id="text-19-1">
<p>
Globálně je DNS spravováno společností ICANN (Internet Corporation for Assigned
Names and Numbers). ICANN akredituje registrátory dalších doménových jmen (Top
Level Domain):
</p>
<ul class="org-ul">
<li>Národní: .cz, .uk, .de</li>
<li>Generické: .com, .edu, .org</li>
</ul>

<p>
Domény první úrovně (TLD) spravuje IANA. Registrace národních domén spravuje
národní správce domény. Za ČR je to CZ-NIC.
</p>

<p>
Domény nižších úrovní spravuje vlastník domény (delegace domén).
</p>
</div>
</div>

<div id="outline-container-org1d62763" class="outline-3">
<h3 id="org1d62763"><span class="section-number-3">19.2</span> Správa IP adres</h3>
<div class="outline-text-3" id="text-19-2">
<p>
IP adresy jsou spravovány a registrovány regionálními registrátory (RIC). Pro
Evropu a část Asie je to RIPE NCC. V jednotlívých státech spravují lokální
registrátoři (LIR) a poskytovatelé připojení. V případě použití Provider
Independent adres může koncový uživatel mít adresu přidělenou přímo od RIR,
která je nezávislá na dalších registrátorech.
</p>
</div>
</div>

<div id="outline-container-org4087fa0" class="outline-3">
<h3 id="org4087fa0"><span class="section-number-3">19.3</span> Whois</h3>
<div class="outline-text-3" id="text-19-3">
<p>
Služba pro zjišťování vlastníka IP adresy.
</p>
</div>
</div>

<div id="outline-container-org2db2a22" class="outline-3">
<h3 id="org2db2a22"><span class="section-number-3">19.4</span> DNS server</h3>
<div class="outline-text-3" id="text-19-4">
<p>
Prostor doménových jmen fyzicky uložen na server DNS. Servery DNS obsahují
informace o stromové struktuře i datech. Každý server spravuje jen část prostoru
doménových jmen &#x2013; Zónu.
</p>

<p>
Typy DNS serverů:
</p>
<ul class="org-ul">
<li>Primární (Master, primary) &#x2013; Obsahuje úplné (autoritativní) záznamy o
doménách. Pro každou doménu existuje pouze jeden primární nameserver</li>
<li>Sekundární (Slave, secondary) &#x2013; Uchovává autoritativní kopie dat od
primárních serverů (přenos zón)</li>
<li>Záložní (Caching-only) &#x2013; Pouze přijíma dotazy, které předává dalším serverům
DNS. Ukládá odpovědi do vyrovnávací paměti. Poskytuje neautoritativni
odpovědi.</li>
</ul>
</div>
</div>

<div id="outline-container-orgdfb9ddb" class="outline-3">
<h3 id="orgdfb9ddb"><span class="section-number-3">19.5</span> Protokol DNS</h3>
<div class="outline-text-3" id="text-19-5">
<p>
Aplikační protokol nad UDP, port 53.
</p>

<p>
Struktura DNS zprávy je následující:
</p>
<ul class="org-ul">
<li>Header</li>
<li>Question</li>
<li>Answer</li>
<li>Authority</li>
<li>Additional</li>
</ul>
</div>
</div>

<div id="outline-container-org2ea3741" class="outline-3">
<h3 id="org2ea3741"><span class="section-number-3">19.6</span> DNS rezoluce</h3>
<div class="outline-text-3" id="text-19-6">
<p>
Komunikace DNS je typu klient &#x2013; server. Dotazy klienta vyřizuje systémová
rutina OS: Resolver.
</p>

<p>
Rezoluje je proces vyhledání odpovědi v systému DNS. Využívá stromovou strukturu
jmen a kořenové DNS servery. Rezoluce začíná od kořenových serverů, těch je 13 a
obsahují speciální kořenovou zónu <code>hint</code>.
</p>
</div>

<div id="outline-container-org3b325c0" class="outline-4">
<h4 id="org3b325c0"><span class="section-number-4">19.6.1</span> Rekurzivní dotaz</h4>
<div class="outline-text-4" id="text-19-6-1">
<p>
Pokud server nezná odpověď, přepošle dotaz dalším serverům. Rekurzivní dotaz si
ukládá do paměti cache pro další použití.
</p>
</div>
</div>

<div id="outline-container-org750a2cf" class="outline-4">
<h4 id="org750a2cf"><span class="section-number-4">19.6.2</span> Iterativní dotaz</h4>
<div class="outline-text-4" id="text-19-6-2">
<p>
Server vrátí nejlepší možnou odpověď. Pokud ale nezná přesnou odpověď, vrátí
odkaz na server, který může znát odpověď.
</p>
</div>
</div>
</div>

<div id="outline-container-org9aae033" class="outline-3">
<h3 id="org9aae033"><span class="section-number-3">19.7</span> Přenos zón</h3>
<div class="outline-text-3" id="text-19-7">
<p>
Přenos zón je komunikace mezi servery DNS. Využívá se k aktualizaci záznamů na
DNS serverech. Je možný celkový přenos zón (AXFR) nebo přírůstkový přenos
(IXFR), kde sekundární server posílá s výzvou záznam SOA a primární server vrátí
rozdílové změny.
</p>

<p>
Mechanismus DNS notify upozorňuje o změně zóny.
</p>
</div>
</div>

<div id="outline-container-org37eed09" class="outline-3">
<h3 id="org37eed09"><span class="section-number-3">19.8</span> Typy záznamů v DNS</h3>
<div class="outline-text-3" id="text-19-8">
</div>
<div id="outline-container-org2605051" class="outline-4">
<h4 id="org2605051"><span class="section-number-4">19.8.1</span> Start of Authority (SOA)</h4>
<div class="outline-text-4" id="text-19-8-1">
<p>
Poskytuje základní informace o zóně. Každá zóna má právě jeden SOA.
</p>

<p>
Obsahuje:
</p>
<ul class="org-ul">
<li>Název primárního serveru a emailovou adresu správce</li>
<li>Sériové číslo identifikující změnu záznamu</li>
<li>Interval pro zjišťování změny (na sekundárních serverech)</li>
<li>Doba, po které se server pokusí aktualizovat zónu v případě ne)spěšného přenosu</li>
<li>Doba platnosti dat na sekundátním serveru</li>
<li>Implicitní doba TTL záznamů v zónovém souboru dané zóny</li>
</ul>
</div>
</div>

<div id="outline-container-org504f56a" class="outline-4">
<h4 id="org504f56a"><span class="section-number-4">19.8.2</span> Name Server (NS)</h4>
<div class="outline-text-4" id="text-19-8-2">
<p>
Určuje autoritativní servery pro danou zónu. Slouží k budování hierarchické
struktury DNS systému. Pro TLD jsou autoritativní servery uvedeny v seznamu
root.zone na IANA.
</p>
</div>
</div>

<div id="outline-container-org0e651ab" class="outline-4">
<h4 id="org0e651ab"><span class="section-number-4">19.8.3</span> A</h4>
<div class="outline-text-4" id="text-19-8-3">
<p>
Přímé mapování doménových adres na IPv4 adresy.
</p>
</div>
</div>

<div id="outline-container-orgeae4d79" class="outline-4">
<h4 id="orgeae4d79"><span class="section-number-4">19.8.4</span> AAAA</h4>
<div class="outline-text-4" id="text-19-8-4">
<p>
Přímé mapování doménových jmen na IPv6 adresy.
</p>
</div>
</div>

<div id="outline-container-orgc627d13" class="outline-4">
<h4 id="orgc627d13"><span class="section-number-4">19.8.5</span> Mail Exchange (MX)</h4>
<div class="outline-text-4" id="text-19-8-5">
<p>
Mapuje adresy poštovních serverů. Přesměrovává poštu pro danou doménu na
konkrétní poštovní server. Lze mít více serverů s různou prioritou.
</p>
</div>
</div>

<div id="outline-container-orge510e8c" class="outline-4">
<h4 id="orge510e8c"><span class="section-number-4">19.8.6</span> Canonical Name (CNAME)</h4>
<div class="outline-text-4" id="text-19-8-6">
<p>
Mapuje alias zařízení na kanonické jméno počítače. Síťové zařízení smí mít více
aliasů. Alias ale nesmí stát na pravé staně záznamu.
</p>
</div>
</div>

<div id="outline-container-orgd64fffd" class="outline-4">
<h4 id="orgd64fffd"><span class="section-number-4">19.8.7</span> Domain Name Pointer (PTR)</h4>
<div class="outline-text-4" id="text-19-8-7">
<p>
Mapuje IPv4 a IPv6 adresu zpětně na doménovou adresu. Využívá speciální podstrom
<code>in-addr.arpa</code> a <code>ip6.arpa</code>.
</p>
</div>
</div>

<div id="outline-container-orgf4edd10" class="outline-4">
<h4 id="orgf4edd10"><span class="section-number-4">19.8.8</span> Naming Autority Pointer (NAPTR)</h4>
<div class="outline-text-4" id="text-19-8-8">
<p>
Mapuje řetězce na data. Podporuje dynamickou konfiguraci systému. Používá
regulární výrazy pro dynamické záznamy v DNS. Příklad je lokaližace VoIP
serveru.
</p>
</div>
</div>

<div id="outline-container-orgd280324" class="outline-4">
<h4 id="orgd280324"><span class="section-number-4">19.8.9</span> Service Record (SRV)</h4>
<div class="outline-text-4" id="text-19-8-9">
<p>
Loaklizuje služby (například SIP, XMPP &#x2026;). Slouží také pro load balancing nebo
zálohování.
</p>
</div>
</div>
