ISA/main.org
*** Text (TXT)
Obsahuje textová data. Dodatečné informace o doméně, serveru, správci a podobně.
Slouží také k ověření mailových serverů nebo ověření vlastnictví domény pro
Google Apps.

** Zabezpečení systému DNS
DNS je distribuovaná veřejná služba, která je potřeba k jakékoliv komunikaci na
internetu. Je potřeba zajistit zejména integritu dat a autentizaci zdroje dat.

*** Bezpečnostní rizika
Podvržené odpovědi mohou vracet neautorizované odpovědi na dotaz klienta.
Podvržená data v paměti cache mohou zneplatnit data pro mnoho klientů. Při DoS
útocích může dojít k blokování jakékoliv DNS rezoluce.

*** DNSSEC
Zajišťuje integritu a autentizaci dat v DNS. Zabezpečuje data DNS pomocí
asymetrické kryptografie (podepisování). Záznamy v DNS zónách jsou podepsány
pomocí Zone Signing Key (ZSK). Klíče pro podepisování záznamů jsou dále
podepsány pomocí Key Signing Key (KSK).

Při použíti DNSSEC nedochází k šifrování DNS provozu.

DNSSEC definuje nové záznamy DNS:
+ DNSKEY: Veřejný klíč pro ověření podpisů
+ RRSIG: Podpis daného záznamu
+ NSEC, NSEC3: Odkaz na další záznam při dotazu na neexistující doménu
+ DS: Záznam pro ověření záznamu DNSKEY, uležen v nadřazené doméně.

Při použití DNSSEC se využívá Chain of Trust. Jední se o mechanismus ověření
pravosti klíče domény nadřazenou doménou. Pro každou zónu existuje pár klíčů
(veřejný -- tajný). Zabezpečení významně zvyšuje velikost paketu DNS.

** Monitorování provozu DNS
Problémem DNS je velká míra informací vztahujících se k odesilateli. IP adresa
lze lokalizovat. Podle meta informací lze zjistit lokální konfiguraci DNS
serveru, podporu IPv6... Informace získané z dotazu DNS napovídají, co uživatel
požaduje za služby, jaké stránky navštěvuje...

DNS byl původně navržen jako veřejná služba přenášející otevřená data.

Lze použít technologii DNS over TLS (DoT), kdy je DNS dotaz šifrován a je viditelný
pouze vybranému DNS serveru. Problém je při výběru serveru a nastavéní
šifrování.

Další možností je DNS over HTTPS (DoH). Dotazy jsou posílány serveru DNS, kterů
je předkonfigurován ve webovém prohlížeči.

Ani jedna z těchto metod neřeší soukromí, pouze problém přesouvají. DNS server
bude vždy vidět rozšifrované DNS dotazy (problém při použití například Google DNS).
