ISA/main.html

<div id="outline-container-orgf239b42" class="outline-4">
<h4 id="orgf239b42"><span class="section-number-4">19.8.10</span> Text (TXT)</h4>
<div class="outline-text-4" id="text-19-8-10">
<p>
Obsahuje textová data. Dodatečné informace o doméně, serveru, správci a podobně.
Slouží také k ověření mailových serverů nebo ověření vlastnictví domény pro
Google Apps.
</p>
</div>
</div>
</div>

<div id="outline-container-orgaa9e5c0" class="outline-3">
<h3 id="orgaa9e5c0"><span class="section-number-3">19.9</span> Zabezpečení systému DNS</h3>
<div class="outline-text-3" id="text-19-9">
<p>
DNS je distribuovaná veřejná služba, která je potřeba k jakékoliv komunikaci na
internetu. Je potřeba zajistit zejména integritu dat a autentizaci zdroje dat.
</p>
</div>

<div id="outline-container-org8823ddb" class="outline-4">
<h4 id="org8823ddb"><span class="section-number-4">19.9.1</span> Bezpečnostní rizika</h4>
<div class="outline-text-4" id="text-19-9-1">
<p>
Podvržené odpovědi mohou vracet neautorizované odpovědi na dotaz klienta.
Podvržená data v paměti cache mohou zneplatnit data pro mnoho klientů. Při DoS
útocích může dojít k blokování jakékoliv DNS rezoluce.
</p>
</div>
</div>

<div id="outline-container-org4a74eb9" class="outline-4">
<h4 id="org4a74eb9"><span class="section-number-4">19.9.2</span> DNSSEC</h4>
<div class="outline-text-4" id="text-19-9-2">
<p>
Zajišťuje integritu a autentizaci dat v DNS. Zabezpečuje data DNS pomocí
asymetrické kryptografie (podepisování). Záznamy v DNS zónách jsou podepsány
pomocí Zone Signing Key (ZSK). Klíče pro podepisování záznamů jsou dále
podepsány pomocí Key Signing Key (KSK).
</p>

<p>
Při použíti DNSSEC nedochází k šifrování DNS provozu.
</p>

<p>
DNSSEC definuje nové záznamy DNS:
</p>
<ul class="org-ul">
<li>DNSKEY: Veřejný klíč pro ověření podpisů</li>
<li>RRSIG: Podpis daného záznamu</li>
<li>NSEC, NSEC3: Odkaz na další záznam při dotazu na neexistující doménu</li>
<li>DS: Záznam pro ověření záznamu DNSKEY, uležen v nadřazené doméně.</li>
</ul>

<p>
Při použití DNSSEC se využívá Chain of Trust. Jední se o mechanismus ověření
pravosti klíče domény nadřazenou doménou. Pro každou zónu existuje pár klíčů
(veřejný &#x2013; tajný). Zabezpečení významně zvyšuje velikost paketu DNS.
</p>
</div>
</div>
</div>

<div id="outline-container-orgef06a1c" class="outline-3">
<h3 id="orgef06a1c"><span class="section-number-3">19.10</span> Monitorování provozu DNS</h3>
<div class="outline-text-3" id="text-19-10">
<p>
Problémem DNS je velká míra informací vztahujících se k odesilateli. IP adresa
lze lokalizovat. Podle meta informací lze zjistit lokální konfiguraci DNS
serveru, podporu IPv6&#x2026; Informace získané z dotazu DNS napovídají, co uživatel
požaduje za služby, jaké stránky navštěvuje&#x2026;
</p>

<p>
DNS byl původně navržen jako veřejná služba přenášející otevřená data.
</p>

<p>
Lze použít technologii DNS over TLS (DoT), kdy je DNS dotaz šifrován a je viditelný
pouze vybranému DNS serveru. Problém je při výběru serveru a nastavéní
šifrování.
</p>

<p>
Další možností je DNS over HTTPS (DoH). Dotazy jsou posílány serveru DNS, kterů
je předkonfigurován ve webovém prohlížeči.
</p>

<p>
Ani jedna z těchto metod neřeší soukromí, pouze problém přesouvají. DNS server
bude vždy vidět rozšifrované DNS dotazy (problém při použití například Google DNS).
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: John Doe</p>
<p class="date">Created: 2019-12-27 Fri 16:05</p>
</div>
</body>
</html>
